Object.defineProperty(exports, '__esModule', {
    value: true
});
exports.default = void 0;
exports.getDegree = getDegree;
exports.getKey = getKey;
exports.waterColors = exports.tabs = exports.skinTypeColors = exports.skinColors = exports.skinColorCopywriting = exports.overviewSuggestion = void 0;
var tabs = [
    {
        label: '总结',
        id: 'overview'
    },
    {
        label: '肤色',
        id: 'skinType'
    },
    {
        label: '粗糙',
        id: 'rough'
    },
    {
        label: '衰老',
        id: 'wrinkle'
    },
    {
        label: '色素',
        id: 'melanin'
    },
    {
        label: '痤疮',
        id: 'acne'
    },
    {
        label: '敏感',
        id: 'sensitivity'
    },
    {
        label: '干油性',
        id: 'oily'
    },
    {
        label: '眼部',
        id: 'eyes'
    }
];
exports.tabs = tabs;
var _default = {
    dark_circle: {
        30: {
            result: '亟待改善',
            copywriting:
                '您存在较为严重的眼部问题，眼袋和眼部细纹明显，可能是由于不良的生活习惯或年龄增长造成的。建议您尽快把医美项目提上日程，通过点阵激光、射频等项目延缓眼部肌肤老化。'
        },
        50: {
            result: '有轻微眼部问题',
            copywriting: '您存在一些眼部问题，黑眼圈较为明显，可能是由于不良的生活习惯或年龄增长造成的，日常要坚持涂抹眼霜，保证睡眠时间。'
        },
        70: {
            result: '眼部状态良好',
            copywriting: '您存在一些轻微的眼部问题，可能是由于不良的生活习惯或年龄增长造成的。建议您平时使用功效型眼霜进行眼部保养，生活中少熬夜，保证睡眠时间。'
        },
        90: {
            result: '眼部状态很好',
            copywriting:
                '您的眼部没有检测出黑眼圈、眼袋或眼部细纹，说明您的眼部状态十分良好。您平时可以使用功效型眼霜进行眼部保养，最重要的是少熬夜，保证睡眠时间，而且最好不要长时间使用电子产品。'
        }
    },
    skin_type: {
        0: {
            result: '油性肤质',
            copywriting:
                '油性皮肤的皮脂腺分泌比较旺盛，从而导致全脸尤其是面中部T区经常泛着油光，油性皮肤多伴随着毛孔粗大、黑头、闭口等现象。日光照射、激素水平变化会导致油脂分泌的加重。油性皮肤更容易由于皮脂和杂质堵塞毛孔而造成痤疮，皮肤也更容易变得暗沉。'
        },
        1: {
            result: '干性肤质',
            copywriting:
                '干性皮肤皮脂腺分泌油脂较少，肌肤屏障较其他肤质更加脆弱，主要表现为在干燥环境下皮肤水分流失加速，从而感到皮肤紧绷、瘙痒，甚至泛红刺痛。过热的环境、日光曝晒和碱性的清洁产品会导致皮肤干燥的加重。'
        },
        2: {
            result: '中性肤质',
            copywriting:
                '您是令人羡慕的中性肌肤，皮肤油脂分泌水平适中。您的屏障健康，很少会发生干燥皮屑、瘙痒刺痛的现象。同时油脂分泌可控使您拥有细腻的毛孔和平滑的皮肤外观。但天气变化、激素水平波动也会导致皮肤的突然过油或过干。'
        },
        3: {
            result: '混合型肤质',
            copywriting:
                '混合型肤质的面中部T区油脂分泌比较旺盛，而面颊部位油脂分泌较少。此类肤质在T区部位会出现毛孔粗大、闭口、黑头等现象，面颊部位在干燥环境、过度清洁后也会产生紧绷、干痒的现象。'
        }
    },
    wrinkle: {
        30: {
            result: '熟龄肌',
            copywriting: '您属于熟龄肌，皱纹和面部轮廓松弛现象已经很明显。随着年龄的增长，皮肤胶原蛋白流失和皮下脂肪流失，肌肤的自我修复能力下降，细纹和皱纹随之增加。'
        },
        50: {
            result: '轻熟肌',
            copywriting: '您属于轻熟龄肌，面部已经检出了若干种皱纹。随着年龄的增长，皮肤胶原蛋白流失和皮下脂肪流失，肌肤的自我修复能力下降，细纹和皱纹随之增加。'
        },
        70: {
            result: '年轻肌',
            copywriting: '您属于年轻肌，面部几乎没有皱纹、下垂、凹陷等衰老迹象。您的皮肤胶原蛋白饱满，但是随着年龄增长，胶原蛋白和皮下脂肪流失，细纹和皱纹会随之增加。'
        },
        90: {
            result: '宝宝肌',
            copywriting: '您属于宝宝肌，面部没有衰老迹象。您的皮肤胶原蛋白非常饱满噢。'
        }
    },
    oily_intensity: {
        30: {
            result: '出油过多',
            copywriting: '您当前的皮肤出油面积较大，建议您使用吸油纸后用保湿喷雾进行补水，等干后使用粉饼轻轻按压补妆。'
        },
        50: {
            result: '较多出油',
            copywriting: '您当前的皮肤有较多出油，建议您使用吸油纸将油脂吸走后使用粉饼轻轻按压补妆。'
        },
        70: {
            result: '轻微出油',
            copywriting: '您当前的皮肤有轻微出油，建议您使用吸油纸将油脂吸走，也可以在使用吸油纸后使用保湿喷雾进行补水。'
        },
        90: {
            result: '面部未出油',
            copywriting: '您当前的皮肤状态很好，没有面部油光。'
        }
    },
    pores: {
        30: {
            result: '重度毛孔',
            copywriting: '您有重度的毛孔问题，皮肤较为粗糙， 建议您平时化妆后彻底卸妆，做好防晒以及补水等基础护肤工作，定期调理皮肤角质哦。'
        },
        50: {
            result: '中度毛孔',
            copywriting: '您有中度的毛孔问题，建议您平时化妆后彻底卸妆，做好防晒以及控油、补水等基础护肤工作哦。'
        },
        70: {
            result: '轻度毛孔',
            copywriting: '您有一些轻度的毛孔问题，建议平常做好防晒以及控油、补水等基础护肤工作哦。'
        },
        90: {
            result: '光滑细腻',
            copywriting: '您有着令人羡慕的肌肤状态，皮肤光滑细腻，没有明显的毛孔。平时需要注意防晒，及时补水哦。'
        }
    },
    blackhead: {
        30: {
            result: '重度黑头',
            copywriting: '您有重度的黑头问题，皮肤较为粗糙，建议您平时化妆后彻底卸妆，做好防晒以及控油、补水等基础护肤工作，定期进行皮肤清洁哦。'
        },
        50: {
            result: '中度黑头',
            copywriting: '您有中度的黑头问题，建议您平时化妆后彻底卸妆，做好防晒和清洁，可以定期进行皮肤清洁哦。'
        },
        70: {
            result: '轻度黑头',
            copywriting: '您有一些轻度的黑头问题，可能是由皮脂分泌过多和清洁不到位导致的。建议您平常做好皮肤清洁和补水哦。'
        },
        90: {
            result: '光滑细腻',
            copywriting: '您的皮肤光滑细腻，没有明显的黑头。平时需要注意防晒，同时做好清洁工作以清除脸部的多余油脂哦。'
        }
    },
    acne: {
        30: {
            result: '严重痤疮',
            copywriting:
                '您的面部检出了较多痘痘，可能是由毛囊角化、细菌感染或皮脂腺分泌旺盛导致的。您需要注意面部清洁和保湿、控油、补水，忌辛辣油腻食物，减少糖分摄入，养成规律作息。建议您去专业的皮肤医院明确皮肤问题，进行科学的治疗。'
        },
        50: {
            result: '中度痘痘痤疮',
            copywriting:
                '您的面部检出了一些痘痘，可能是由毛囊角化、细菌感染或皮脂腺分泌旺盛导致的。您需要注意面部清洁和保湿、控油、补水，忌辛辣油腻食物，减少糖分摄入，养成规律作息。外敷壬二酸、过氧化苯甲酰和水杨酸也是常用的治疗手段。您还可以通过光动力治疗、PDT等医美项目实现迅速改善。'
        },
        70: {
            result: '轻微痘痘痤疮',
            copywriting:
                '您的面部检出了少量的痘痘，可能是由毛囊角化、细菌感染或皮脂腺分泌旺盛导致的。您需要注意面部清洁和保湿、控油、补水，忌辛辣油腻食物，减少糖分摄入，养成规律作息。外敷壬二酸、过氧化苯甲酰和水杨酸也是常用的治疗手段。'
        },
        90: {
            result: '无痘痘痤疮',
            copywriting:
                '您没有检测出痘痘，皮肤十分健康，请继续保持～面部皮肤十分脆弱，毛囊角质化、细菌感染、皮脂腺分泌旺盛都可能导致痘痘，您需要注意面部清洁和保湿补水，忌辛辣油腻食物，养成规律作息。'
        }
    },
    sensitivity: {
        30: {
            result: '非常敏感',
            copywriting:
                '您的面部皮肤十分敏感，皮肤屏障受损严重，面颊有明显泛红。您平时可以用温水洗面，避免频繁使用深度清洁产品以防过度去角质。除了使用无酒精和防腐剂添加的补水产品，您还可以使用含有神经酰胺成分的温和护肤品以帮助修复皮肤屏障，同时建议您前往专业的皮肤医院就诊。'
        },
        50: {
            result: '较敏感',
            copywriting:
                '您的面部皮肤较敏感，皮肤屏障受损较严重，面颊有明显泛红。您平时可以用温水洗面，避免频繁使用深度清洁产品以防过度去角质。此外，使用含有神经酰胺成分的温和护肤品可以帮助修复皮肤屏障。'
        },
        70: {
            result: '轻度敏感',
            copywriting:
                '您是轻度敏感肌，皮肤屏障轻微受损，面颊有些许泛红。您平时可以用温水洗面，避免频繁使用深度清洁产品以防过度去角质。此外，使用含有神经酰胺成分的温和护肤品可以帮助修复皮肤屏障。'
        },
        90: {
            result: '非敏感肌',
            copywriting: '您是非敏感肌，皮肤屏障未受损。平日护肤请注意不要过度去角质，保护皮肤屏障，呵护脆弱肌肤。'
        }
    },
    melanin: {
        30: {
            result: '重度色沉',
            copywriting:
                '您的面部的色沉比较严重，主要表现在色斑和大面积肤色不均。您面部的色沉可能是由UVA光损伤和炎症后的肌肤应激引起，长期无防护下的日晒会导致肤色不均和晒斑的产生，痤疮、炎症也会导致黑色素沉积。'
        },
        50: {
            result: '中度色沉',
            copywriting:
                '您的面部已经出现色沉现象，主要表现在色斑和肤色不均。您面部的色沉可能是由UVA光损伤和炎症后的肌肤应激引起，长期无防护下的日晒会导致肤色不均和晒斑的产生，痤疮、炎症也会导致黑色素沉积。'
        },
        70: {
            result: '轻度色沉',
            copywriting:
                '您的面部已经出现轻微的色沉现象，主要表现在色斑和轻微的肤色不均。您面部的色沉可能是由UVA光损伤和炎症后的肌肤应激引起，长期无防护下的日晒会导致肤色不均和晒斑的产生，痤疮、炎症也会导致黑色素沉积。'
        },
        90: {
            result: '匀净无明显色沉',
            copywriting:
                '您没有明显的色素沉着问题，面部色斑较少，整体肤色均匀。UVA光损伤和炎症后的肌肤应激反应是导致色素沉着的元凶，保持匀净的肤色需要依赖良好的防晒习惯和稳定的肌肤状态。'
        }
    },
    water: {
        30: {
            result: '缺水过多',
            copywriting: '您当前的皮肤缺水面积较大，建议您建议您前往专业的皮肤医院就诊，明确缺水的根源，及时更换护肤品。'
        },
        50: {
            result: '较多缺水',
            copywriting: '您当前的皮肤有较多的缺水情况，建议您日常多使用补水的产品，按时敷补水面膜，按时休息。'
        },
        70: {
            result: '轻微缺失',
            copywriting: '您当前的皮肤有轻微缺水情况，建议您使用补水喷雾进行补水，每周按时敷补水面膜。'
        },
        90: {
            result: '面部不缺水',
            copywriting: '您当前的皮肤状态很好，几乎没有缺水状况。'
        }
    },
    rough: {
        30: {
            result: '重度粗糙',
            copywriting: '您当前的皮肤粗糙面积较大，建议您前往专业的皮肤医院就诊，明确肌肤问题。'
        },
        50: {
            result: '中度粗糙',
            copywriting: '您当前的皮肤粗糙面积稍大，建议您结合痘痘、闭口情况，选取对症下药的护肤品进行护肤。'
        },
        70: {
            result: '轻微粗糙',
            copywriting: '您当前的皮肤粗糙面积较小，建议您调整作息，少熬夜，适当进行面部清洁。'
        },
        90: {
            result: '面部不粗糙',
            copywriting: '您当前的皮肤状态很好，面部非常光滑。'
        }
    },
    jawline: {
        1: {
            result: '下颌线较不流畅',
            copywriting: '您的下颌线有待提升，建议您前往专业的皮肤医院就诊，明确下颌线问题，进行面部线条的提升优化。'
        },
        0: {
            result: '下颌线流畅',
            copywriting: '您的下颌线相对清晰，日常可以定期进行下颌线训练，保持面部清晰流畅的线条！'
        }
    }
};
exports.default = _default;
function getKey(score) {
    if (score < 50) {
        return 30;
    }
    if (score < 70) {
        return 50;
    }
    if (score < 90) {
        return 70;
    }
    return 90;
}
function getDegree(score) {
    if (score < 50) {
        return '重度';
    }
    if (score < 70) {
        return '中度';
    }
    if (score < 90) {
        return '轻度';
    }
    return '无';
}
var skinColors = [
    {
        title: '透白',
        color: '#FFF5E2'
    },
    {
        title: '白皙',
        color: '#FEEDD5'
    },
    {
        title: '自然',
        color: '#FCE4C4'
    },
    {
        title: '小麦',
        color: '#CFA387'
    },
    {
        title: '棕色',
        color: '#A27940'
    },
    {
        title: '深棕',
        color: '#725D33'
    },
    {
        title: '异常',
        color: '#000'
    }
];
exports.skinColors = skinColors;
var waterColors = [
    {
        title: '不缺水',
        color: '#7FE2FF'
    },
    {
        title: '轻度',
        color: '#A5EAFF'
    },
    {
        title: '中度',
        color: '#CCF3FF'
    },
    {
        title: '重度',
        color: '#E5F9FF'
    }
];
exports.waterColors = waterColors;
var skinTypeColors = [
    {
        title: '油性',
        color: '#FFCF27',
        fulltext: '油性皮肤'
    },
    {
        title: '干性',
        color: '#E9C98D',
        fulltext: '干性皮肤'
    },
    {
        title: '中性',
        color: '#FFECE1',
        fulltext: '中性皮肤'
    },
    {
        title: '混合',
        color: '#D29C7D',
        fulltext: '混合性皮肤'
    }
];
exports.skinTypeColors = skinTypeColors;
var overviewSuggestion = {
    wrinkle: '衰老：您可以开始抗老了，皱纹和面部轮廓松弛现象已经出现。日常要注意抗氧化和纹路护理哦。',
    melanin: '色素：您的面部已经开始出现色素问题，平常要多注意防晒，也可以配合使用抗氧化类产品辅助面部变得干净哦。',
    rough: '粗糙：您的面部已经开始出现粗糙现象，平常要多注重保湿补水，可以适当配合清洁类产品哦。',
    eyes: '眼部：你的眼睛已经开始出现黑眼圈了，需要保证健康作息，坚持涂抹眼霜哦。',
    acne: '痤疮：您的面部检测出了一些痘痘，建议日常尽量使用温和的产品，可以在局部配合祛痘产品哦。',
    sensitivity: '敏感：您的皮肤有点容易敏感，建议日常尽量挑选成分温和、精简的护肤品哦。',
    oily: '干油性：建议您日常注意肌肤保湿，定期敷面膜补水哦。'
};
exports.overviewSuggestion = overviewSuggestion;
var skinColorCopywriting = {
    0: {
        result: '透白',
        copywriting: '您的皮肤色素分布浓度较少，需要特别注意防晒，避免被日光晒伤，做好保湿。'
    },
    1: {
        result: '白皙',
        copywriting: '您的皮肤色素分布浓度较少，需要特别注意防晒，避免被日光晒伤，做好保湿。'
    },
    2: {
        result: '自然中等肤色',
        copywriting: '您的色素分布浓度中等，做好日常防晒、避免增加黑素合成，如果面对高强度紫外线照射需要高强度保湿。'
    },
    3: {
        result: '小麦色',
        copywriting: '您的色素分布浓度偏高，注意做好防晒、避免长时间紫外线照射从而增加黑素合成，如果面对高强度紫外线照射需要高强度保湿。'
    },
    4: {
        result: '棕色',
        copywriting: '您的色素分布浓度较高，您的皮肤虽然不易被晒伤，但容易晒后色素沉淀，需要做好晒后修复'
    },
    5: {
        result: '深棕',
        copywriting: '您的色素分布浓度较高，您的皮肤虽然不易被晒伤，但容易晒后色素沉淀，需要做好晒后修复'
    },
    6: {
        result: '异常',
        copywriting: '您拍摄的照片显示有些异常，建议重新拍摄哦'
    }
};
exports.skinColorCopywriting = skinColorCopywriting;
